БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаОперативнойЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.CW_КорректировкаАктированияСчетов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийКорректировкиОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКредитор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговоруКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписаниеОперативнойЗадолженности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАкт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяДебиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяДебиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперативнойЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
	ВалютаРегламентированногоУчета = CW_Настройки.ВалютаРегламентированногоУчета();
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.CW_КорректировкаАктированияСчетов") Тогда
		
		// заполняем шапку
		Организация 			= ДанныеЗаполнения.Организация;
		Контрагент 				= ДанныеЗаполнения.Контрагент;
		Договор 				= ДанныеЗаполнения.Договор; 
		ПриложениеКДоговору 	= ДанныеЗаполнения.ПриложениеКДоговору; 
		
		ВидЗадолженности	= ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская");
		ВидОперации			= ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийКорректировкиОперативнойЗадолженности.СписаниеЗадолженности");

		// заполняем на основании корректировки актирования
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	CW_КорректировкаАктированияСчетовКорректировкаАктирования.ИсходящийСчет КАК ИсходящийСчет,
		               |	СУММА(CW_КорректировкаАктированияСчетовКорректировкаАктирования.Всего) КАК Всего
		               |ПОМЕСТИТЬ ВТ_ДанныеКорректировки
		               |ИЗ
		               |	Документ.CW_КорректировкаАктированияСчетов.КорректировкаАктирования КАК CW_КорректировкаАктированияСчетовКорректировкаАктирования
		               |ГДЕ
		               |	CW_КорректировкаАктированияСчетовКорректировкаАктирования.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_КорректировкаАктированияСчетовКорректировкаАктирования.ИсходящийСчет
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Счет,
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ДатаСчета КАК ДатаСчета,
		               |	CW_ДоходыПоГрузоперевозкеУслуги.СчетЗадолженности КАК СчетЗадолженности,
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Валюта КАК Валюта,
		               |	ВТ_ДанныеКорректировки.Всего КАК Всего
		               |ИЗ
		               |	ВТ_ДанныеКорректировки КАК ВТ_ДанныеКорректировки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		               |		ПО ВТ_ДанныеКорректировки.ИсходящийСчет = CW_ДоходыПоГрузоперевозкеУслуги.Ссылка
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_ДанныеКорректировки.ИсходящийСчет КАК ИсходящийСчет
		               |			ИЗ
		               |				ВТ_ДанныеКорректировки КАК ВТ_ДанныеКорректировки)";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураКурса  = CW_Финансы.ПолучитьКурсВалюты(Выборка.Валюта, Выборка.ДатаСчета);
			
			СтрокаДокумента = СписаниеОперативнойЗадолженности.Добавить();
			СтрокаДокумента.СчетЗадолженности 	= Выборка.СчетЗадолженности;
			СтрокаДокумента.ДокументСчет 		= Выборка.Счет;
			СтрокаДокумента.Валюта 				= Выборка.Валюта;
			СтрокаДокумента.Курс 				= СтруктураКурса.Курс;
			СтрокаДокумента.Кратность 			= СтруктураКурса.Кратность;
			СтрокаДокумента.СуммаВал 			= Выборка.Всего;  
			
			СтрокаДокумента.Сумма =  CW_Финансы.ПересчитатьИзВалютыВВалюту(Выборка.Всего,
										Выборка.Валюта, ВалютаРегламентированногоУчета,
										СтруктураКурса.Курс, 1,
										СтруктураКурса.Кратность,1);
			
		КонецЦикла;
		
	КонецЕсли; 
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)       
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеВидаЗадолженности  = ПолучитьСоответствиеВидаЗадолженностиВидуДоговора();
	
	ВидЗадолженности = СоответствиеВидаЗадолженности.Получить(Договор.ВидДоговора);
	ВидЗадолженности = ?(ВидЗадолженности=Неопределено, ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская"), ВидЗадолженности);  
	
	Для каждого СтрокаТаблицы Из ДебиторскаяЗадолженность Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидЗадолженности) Тогда
			СтрокаТаблицы.ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская");
		КонецЕсли; 
	КонецЦикла;  
	
	Для каждого СтрокаТаблицы Из КредиторскаяЗадолженность Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидЗадолженности) Тогда
			СтрокаТаблицы.ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская");
		КонецЕсли; 
	КонецЦикла; 
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийКорректировкиОперативнойЗадолженности.СписаниеЗадолженности") Тогда
		СуммаДокумента = СписаниеОперативнойЗадолженности.Итог("СуммаВал");
	Иначе
		СуммаДокумента = ДебиторскаяЗадолженность.Итог("СуммаВал");
	конецЕсли;   
	
КонецПроцедуры     

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Набор Из Движения Цикл
		Набор.Прочитать();
		Набор.Очистить();
	КонецЦикла;  
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ОтключитьЛогикуПроведения")
		И ДополнительныеСвойства.ОтключитьЛогикуПроведения = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли; 
	
	ВалютаРегламентированногоУчета 	= CW_Настройки.ВалютаРегламентированногоУчета();  
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийКорректировкиОперативнойЗадолженности.СписаниеЗадолженности") Тогда
		
		Если Договор.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") и
			Договор.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
			Возврат;	
		КонецЕсли;
		
		СформироватьДвиженияПоСписаниюЗадолженности(ВалютаРегламентированногоУчета); 
		
		Если Договор.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда  
			
			СтруктураПарамтеров = Новый Структура;
			СтруктураПарамтеров.Вставить("Контрагент",		Контрагент);
			СтруктураПарамтеров.Вставить("Договор",			Договор);   
			СтруктураПарамтеров.Вставить("ВалютаОбъекта", 	Договор.ВалютаДоговора);
			
			//Подсистема.УчетПриложенийДоговоров
			СтруктураПарамтеров.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
			//Подсистема.УчетПриложенийДоговоров
	
			СформироватьСписаниеКурсовыхРазниц(СтруктураПарамтеров); 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийКорректировкиОперативнойЗадолженности.ЗачетЗадолженности") Тогда
		
		ПроверитьСуммыЗачетаЗадолженности(ВалютаРегламентированногоУчета, Отказ);
		
		СформироватьДвиженияПоЗачетуЗадолженности(ВалютаРегламентированногоУчета); 
		
		Если Договор.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда  
			
			СтруктураПарамтеров = Новый Структура;
			СтруктураПарамтеров.Вставить("Контрагент",		Контрагент);
			СтруктураПарамтеров.Вставить("Договор",			Договор);   
			СтруктураПарамтеров.Вставить("ВалютаОбъекта", 	Договор.ВалютаДоговора);
			
			//Подсистема.УчетПриложенийДоговоров
			СтруктураПарамтеров.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
			//Подсистема.УчетПриложенийДоговоров
			
			СформироватьСписаниеКурсовыхРазниц(СтруктураПарамтеров); 

		КонецЕсли; 
		
		Если ДоговорКредитор.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда 
			СтруктураПарамтеров = Новый Структура;
			СтруктураПарамтеров.Вставить("Контрагент",		КонтрагентКредитор);
			СтруктураПарамтеров.Вставить("Договор",			ДоговорКредитор);   
			СтруктураПарамтеров.Вставить("ВалютаОбъекта", 	ДоговорКредитор.ВалютаДоговора);
			
			//Подсистема.УчетПриложенийДоговоров
			СтруктураПарамтеров.Вставить("ПриложениеКДоговору", ПриложениеКДоговоруКредитор);
			//Подсистема.УчетПриложенийДоговоров

			СформироватьСписаниеКурсовыхРазниц(СтруктураПарамтеров);
		КонецЕсли;
		
									
	КонецЕсли; 
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийКорректировкиОперативнойЗадолженности.ПереносЗадолженности") Тогда
		
		Если ДоговорКредитор.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") и
			ДоговорКредитор.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
			Возврат;	
		КонецЕсли;

		ФормироватьКурсовуюРазницу = ложь;
		
		СформироватьДвиженияПоПереносуЗадолженности(ВалютаРегламентированногоУчета); 
		
	КонецЕсли; 
	
		
КонецПроцедуры

Процедура ПроверитьСуммыЗачетаЗадолженности(Знач ВалютаРегламентированногоУчета, Отказ)
	
	ИмяПоляКЗ = "СуммаВал";
	Если ДоговорКредитор.ВалютаДоговора = ВалютаРегламентированногоУчета 
		или ДоговорКредитор.ВзаиморасчетыВУЕ Тогда
		ИмяПоляКЗ = "Сумма";
	КонецЕсли;  
	
	ИмяПоляДЗ = "СуммаВал";
	Если Договор.ВалютаДоговора = ВалютаРегламентированногоУчета 
		или Договор.ВзаиморасчетыВУЕ Тогда
		ИмяПоляДЗ = "Сумма";
	КонецЕсли;

	Если ДоговорКредитор.ВзаиморасчетыВУЕ и Договор.ВзаиморасчетыВУЕ Тогда
		ИмяПоляДЗ = "СуммаВал"; 
		ИмяПоляКЗ = "СуммаВал";
	КонецЕсли;
	
	Если КредиторскаяЗадолженность.Итог(ИмяПоляКЗ) <> ДебиторскаяЗадолженность.Итог(ИмяПоляДЗ) Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отличаются суммы дебиторской и кредиторской задолженности!",,,,Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьДвиженияПоЗачетуЗадолженности(ВалютаРегламентированногоУчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДебиторскаяЗадолженность.Ссылка.Контрагент КАК Контрагент,
	               |	ДебиторскаяЗадолженность.Ссылка.Договор КАК Договор,
	               |	ДебиторскаяЗадолженность.Ссылка.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	ДебиторскаяЗадолженность.ВидЗадолженности КАК ВидЗадолженности,
	               |	ДебиторскаяЗадолженность.ДокументСчет КАК ДокументСчет,
	               |	ДебиторскаяЗадолженность.Валюта КАК Валюта,
	               |	ДебиторскаяЗадолженность.СчетЗадолженности КАК СчетЗадолженности,
	               |	ДебиторскаяЗадолженность.СуммаВал КАК СуммаВал,
	               |	ДебиторскаяЗадолженность.Сумма КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ДебиторскаяЗадолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ПриходРасход
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.CW_КорректировкаОперативнойЗадолженности.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
	               |ГДЕ
	               |	ДебиторскаяЗадолженность.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КредиторскаяЗадолженность.Ссылка.КонтрагентКредитор,
	               |	КредиторскаяЗадолженность.Ссылка.ДоговорКредитор,
	               |	КредиторскаяЗадолженность.Ссылка.ПриложениеКДоговоруКредитор,
	               |	КредиторскаяЗадолженность.ВидЗадолженности,
	               |	КредиторскаяЗадолженность.ДокументСчет,
	               |	КредиторскаяЗадолженность.Валюта,
	               |	КредиторскаяЗадолженность.СчетЗадолженности,
	               |	КредиторскаяЗадолженность.СуммаВал,
	               |	КредиторскаяЗадолженность.Сумма,
	               |	ВЫБОР
	               |		КОГДА КредиторскаяЗадолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.CW_КорректировкаОперативнойЗадолженности.КредиторскаяЗадолженность КАК КредиторскаяЗадолженность
	               |ГДЕ
	               |	КредиторскаяЗадолженность.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	//Дебиторская задолженность
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Контрагент КАК Контрагент,
	               |	ВТ_ДанныеДокумента.Договор КАК Договор,
	               |	ВТ_ДанныеДокумента.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	ВТ_ДанныеДокумента.ВидЗадолженности КАК ВидЗадолженности,
	               |	ВТ_ДанныеДокумента.ДокументСчет КАК ДокументСчет,
	               |	ВТ_ДанныеДокумента.Валюта КАК Валюта,
	               |	ВТ_ДанныеДокумента.СчетЗадолженности КАК СчетЗадолженности,
	               |	СУММА(ВТ_ДанныеДокумента.СуммаВал) КАК СуммаВал,
	               |	СУММА(ВТ_ДанныеДокумента.Сумма) КАК Сумма,
	               |	ВТ_ДанныеДокумента.ПриходРасход КАК ПриходРасход,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.ДокументСчет ССЫЛКА Документ.CW_ДоходыПоГрузоперевозке
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВТ_ДанныеДокумента.ДокументСчет ССЫЛКА Документ.CW_РасходыПоГрузоперевозке
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ФормироватьОплатуИсходящих
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |ГДЕ
	               |	ВТ_ДанныеДокумента.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеДокумента.Контрагент,
	               |	ВТ_ДанныеДокумента.Договор,
	               |	ВТ_ДанныеДокумента.ПриложениеКДоговору,
	               |	ВТ_ДанныеДокумента.Валюта,
	               |	ВТ_ДанныеДокумента.ВидЗадолженности,
	               |	ВТ_ДанныеДокумента.ДокументСчет,
	               |	ВТ_ДанныеДокумента.СчетЗадолженности,
	               |	ВТ_ДанныеДокумента.ПриходРасход";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.CW_ОперативнаяДебиторскаяЗадолженность.Добавить();
		Движение.ВидДвижения 	= ?(Выборка.ПриходРасход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Период			= Дата;
		Движение.ВидОперации	= ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Корректировка");
		Движение.Организация 	= Договор.Организация;
		Движение.Контрагент 	= Выборка.Контрагент;
		Движение.Договор 		= Выборка.Договор;  
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = Выборка.ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров  
		
		Движение.Валюта 		= Выборка.Валюта;
		Движение.Счет 			= Выборка.ДокументСчет;
		Движение.СчетУчета 		= Выборка.СчетЗадолженности;
		Движение.Всего_Валюта 	= Выборка.СуммаВал;
		Движение.Всего 			= Выборка.Сумма;   
		
		Если Выборка.ФормироватьОплатуИсходящих Тогда
			Движение = Движения.CW_ОплатаИсходящихДокументов.Добавить();
			Движение.Период 			= Дата;
			Движение.Документ 			= Выборка.ДокументСчет;
			Движение.ДокументОплаты 	= Ссылка;
			Движение.СчетЗадолженности 	= Выборка.СчетЗадолженности;
			Движение.Всего 				= Выборка.СуммаВал;
		КонецЕсли; 
		
	КонецЦикла;  
	//Дебиторская задолженность  
	
	//Кредиторская задолженность
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Контрагент КАК Контрагент,
				   |	ВТ_ДанныеДокумента.Договор КАК Договор,
				   |	ВТ_ДанныеДокумента.ПриложениеКДоговору КАК ПриложениеКДоговору,
				   |	ВТ_ДанныеДокумента.ВидЗадолженности КАК ВидЗадолженности,
				   |	ВТ_ДанныеДокумента.ДокументСчет КАК ДокументСчет,
				   |	ВТ_ДанныеДокумента.Валюта КАК Валюта,
				   |	ВТ_ДанныеДокумента.СчетЗадолженности КАК СчетЗадолженности,
				   |	СУММА(ВТ_ДанныеДокумента.СуммаВал) КАК СуммаВал,
				   |	СУММА(ВТ_ДанныеДокумента.Сумма) КАК Сумма,
				   |	ВТ_ДанныеДокумента.ПриходРасход КАК ПриходРасход,
				   |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.ДокументСчет ССЫЛКА Документ.CW_ДоходыПоГрузоперевозке
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВТ_ДанныеДокумента.ДокументСчет ССЫЛКА Документ.CW_РасходыПоГрузоперевозке
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ФормироватьОплатуВходящих
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |ГДЕ
	               |	ВТ_ДанныеДокумента.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеДокумента.Контрагент,
	               |	ВТ_ДанныеДокумента.Договор,
	               |	ВТ_ДанныеДокумента.ПриложениеКДоговору,
	               |	ВТ_ДанныеДокумента.ВидЗадолженности,
	               |	ВТ_ДанныеДокумента.ДокументСчет,
	               |	ВТ_ДанныеДокумента.Валюта,
	               |	ВТ_ДанныеДокумента.СчетЗадолженности,
	               |	ВТ_ДанныеДокумента.ПриходРасход,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.ДокументСчет ССЫЛКА Документ.CW_ДоходыПоГрузоперевозке
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВТ_ДанныеДокумента.ДокументСчет ССЫЛКА Документ.CW_РасходыПоГрузоперевозке
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ";   
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.CW_ОперативнаяКредиторскаяЗадолженность.Добавить();
		Движение.ВидДвижения 	= ?(Выборка.ПриходРасход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Период			= Дата;
		Движение.ВидОперации	= ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Корректировка");
		Движение.Организация 	= Выборка.Договор.Организация;
		Движение.Контрагент 	= Выборка.Контрагент;
		Движение.Договор 		= Выборка.Договор;  
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = Выборка.ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров  
		
		Движение.Валюта 		= Выборка.Валюта;
		Движение.Счет 			= Выборка.ДокументСчет;
		Движение.СчетУчета 		= Выборка.СчетЗадолженности;
		Движение.Всего_Валюта 	= Выборка.СуммаВал;
		Движение.Всего 			= Выборка.Сумма;
		
		Если Выборка.ФормироватьОплатуВходящих Тогда
			
			Движение = Движения.CW_ОплатаВходящихДокументов.Добавить();
			Движение.Период 			= Дата;
			Движение.Документ 			= Выборка.ДокументСчет;
			Движение.ДокументОплаты 	= Ссылка;
			Движение.СчетЗадолженности 	= Выборка.СчетЗадолженности;
			Движение.Всего 				= Выборка.СуммаВал;
			
		КонецЕсли; 
		
	КонецЦикла; 
	//Кредиторская задолженность
	
КонецПроцедуры

Процедура СформироватьДвиженияПоСписаниюЗадолженности(ВалютаРегламентированногоУчета)

	Для Каждого СтрокаТаблицы из СписаниеОперативнойЗадолженности Цикл
		
		Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда 
			НаборЗаписей = Движения.CW_ОперативнаяКредиторскаяЗадолженность;
			ИмяРегистра	= "CW_ОперативнаяКредиторскаяЗадолженность";
		КонецЕсли;
		Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
			НаборЗаписей = Движения.CW_ОперативнаяДебиторскаяЗадолженность;
			ИмяРегистра	= "CW_ОперативнаяДебиторскаяЗадолженность";
		КонецЕсли;
		
		Движение 	= НаборЗаписей.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.Контрагент		= Контрагент;
		Движение.Договор 		= Договор;
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров
		
		Движение.Валюта 	= СтрокаТаблицы.Валюта;
		Движение.Счет 		= СтрокаТаблицы.ДокументСчет;
		Движение.СчетУчета 	= СтрокаТаблицы.СчетЗадолженности;
		
		Движение.Всего_Валюта 	= СтрокаТаблицы.СуммаВал;
		Движение.Всего 			= СтрокаТаблицы.Сумма;  
		
		Движение.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Корректировка");
		
		//Регистры: CW_ОплатаВходящихДокументов и  CW_ОплатаИсходящихДокументов
		Если ТипЗнч(СтрокаТаблицы.ДокументСчет) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
			ИЛИ ТипЗнч(СтрокаТаблицы.ДокументСчет) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			
			Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
				ДвижениеОплата = Движения.CW_ОплатаВходящихДокументов.Добавить();
			КонецЕсли;
			Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
				ДвижениеОплата = Движения.CW_ОплатаИсходящихДокументов.Добавить();
			КонецЕсли;   
			
			ДвижениеОплата.Период 				= Дата;
			ДвижениеОплата.Документ 			= СтрокаТаблицы.ДокументСчет;
			ДвижениеОплата.ДокументБУ 			= СтрокаТаблицы.ДокументАкт;
			ДвижениеОплата.ДокументОплаты 		= Ссылка;
			ДвижениеОплата.СчетЗадолженности 	= СтрокаТаблицы.СчетЗадолженности;
			ДвижениеОплата.Всего 				= СтрокаТаблицы.СуммаВал;
			ДвижениеОплата.ПризнакАкта 			= ЗначениеЗаполнено(СтрокаТаблицы.ДокументАкт);
			
		КонецЕсли;  
		//Регистры: CW_ОплатаВходящихДокументов и  CW_ОплатаИсходящихДокументов
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура СформироватьДвиженияПоПереносуЗадолженности(ВалютаРегламентированногоУчета)
	
	Для Каждого СтрокаТаблицы из СписаниеОперативнойЗадолженности Цикл
		
		Если ДоговорКредитор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда 
			НаборЗаписей = Движения.CW_ОперативнаяКредиторскаяЗадолженность;
		КонецЕсли;
		Если ДоговорКредитор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
			НаборЗаписей = Движения.CW_ОперативнаяДебиторскаяЗадолженность;
		КонецЕсли;
		
		//Списание задолженности
		Движение 	= НаборЗаписей.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.Контрагент		= КонтрагентКредитор;
		Движение.Договор 		= ДоговорКредитор;
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = ПриложениеКДоговоруКредитор;
		//Подсистема.УчетПриложенийДоговоров
		
		Движение.Валюта 	= СтрокаТаблицы.Валюта;
		Движение.Счет 		= СтрокаТаблицы.ДокументСчет;
		Движение.СчетУчета 	= СтрокаТаблицы.СчетЗадолженности;
		
		Движение.Всего_Валюта 	= СтрокаТаблицы.СуммаВал;
		Движение.Всего 			= СтрокаТаблицы.Сумма;
		
		Движение.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Корректировка");   
		//Списание задолженности     
		
		//Поступление задолженности
		Движение 	= НаборЗаписей.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.Контрагент		= Контрагент;
		Движение.Договор 		= Договор;
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров
		
		Движение.Валюта 	= СтрокаТаблицы.Валюта;
		Движение.Счет 		= Ссылка;
		Движение.СчетУчета 	= СтрокаТаблицы.СчетЗадолженности;
		
		Движение.Всего_Валюта 	= СтрокаТаблицы.СуммаВал;
		Движение.Всего 			= СтрокаТаблицы.Сумма;  
		
		Движение.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Корректировка");
		//Поступление задолженности
	
		//Регистры: CW_ОплатаВходящихДокументов и  CW_ОплатаИсходящихДокументов
		Если ТипЗнч(СтрокаТаблицы.ДокументСчет) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
			ИЛИ ТипЗнч(СтрокаТаблицы.ДокументСчет) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			
			Если ДоговорКредитор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
				ДвижениеОплата = Движения.CW_ОплатаВходящихДокументов.Добавить();
			КонецЕсли;
			Если ДоговорКредитор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
				ДвижениеОплата = Движения.CW_ОплатаИсходящихДокументов.Добавить();
			КонецЕсли;   
			
			ДвижениеОплата.Период 				= Дата;
			ДвижениеОплата.Документ 			= СтрокаТаблицы.ДокументСчет;
			ДвижениеОплата.ДокументБУ 			= СтрокаТаблицы.ДокументАкт;
			ДвижениеОплата.ДокументОплаты 		= Ссылка;
			ДвижениеОплата.СчетЗадолженности 	= СтрокаТаблицы.СчетЗадолженности;
			ДвижениеОплата.Всего 				= СтрокаТаблицы.СуммаВал;
			ДвижениеОплата.ПризнакАкта 			= ЗначениеЗаполнено(СтрокаТаблицы.ДокументАкт);
			
		КонецЕсли;  
		//Регистры: CW_ОплатаВходящихДокументов и  CW_ОплатаИсходящихДокументов
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура СформироватьСписаниеКурсовыхРазниц(СтруктураПарамтеров)
	
	СтруктураПарамтеров.Вставить("Дата", 			Дата);
	СтруктураПарамтеров.Вставить("ДатаСреза", 		МоментВремени());    
	СтруктураПарамтеров.Вставить("Организация",		Организация);  
	
	СтруктураПарамтеров.Вставить("Набор",			Движения.CW_ОперативнаяДебиторскаяЗадолженность);
	СтруктураПарамтеров.Вставить("ИмяРегистраОперативнойЗадолженности",	"CW_ОперативнаяДебиторскаяЗадолженность" );
	CW_Финансы.СписаниеКурсовыеПоОперативнойЗадолженности(СтруктураПарамтеров);
	
	СтруктураПарамтеров.Вставить("ИмяРегистраОперативнойЗадолженности",	"CW_ОперативнаяКредиторскаяЗадолженность" );
	СтруктураПарамтеров.Вставить("Набор",			Движения.CW_ОперативнаяКредиторскаяЗадолженность);  
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийКорректировкиОперативнойЗадолженности.ЗачетЗадолженности") Тогда
		//Подсистема.УчетПриложенийДоговоров
		СтруктураПарамтеров.Вставить("ПриложениеКДоговору", ПриложениеКДоговоруКредитор);
		//Подсистема.УчетПриложенийДоговоров                                                                                                     
	КонецЕсли;
	
	CW_Финансы.СписаниеКурсовыеПоОперативнойЗадолженности(СтруктураПарамтеров);

КонецПроцедуры

Функция ПолучитьСоответствиеВидаЗадолженностиВидуДоговора()
	
	ВидыДоговоровКонтрагентов 		= Перечисления.ВидыДоговоровКонтрагентов;
	ВидыОперативнойЗадолженности 	= Перечисления.CW_ВидыОперативнойЗадолженности;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ВидыДоговоровКонтрагентов.СПокупателем, ВидыОперативнойЗадолженности.Дебиторская);
	Соответствие.Вставить(ВидыДоговоровКонтрагентов.СПоставщиком, ВидыОперативнойЗадолженности.Кредиторская);
	
	Возврат Соответствие;
	
КонецФункции
#КонецЕсли
